> Device : cpu
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 32, 1024]             608
       BatchNorm2d-2         [-1, 32, 32, 1024]              64
            Conv2d-3         [-1, 32, 32, 1024]           1,056
       BatchNorm2d-4         [-1, 32, 32, 1024]              64
            Conv2d-5         [-1, 64, 32, 1024]           2,112
       BatchNorm2d-6         [-1, 64, 32, 1024]             128
PointNetSetAbstraction-7  [[-1, 3, 1024], [-1, 64, 1024]]               0
            Conv2d-8          [-1, 64, 32, 256]           4,352
       BatchNorm2d-9          [-1, 64, 32, 256]             128
           Conv2d-10          [-1, 64, 32, 256]           4,160
      BatchNorm2d-11          [-1, 64, 32, 256]             128
           Conv2d-12         [-1, 128, 32, 256]           8,320
      BatchNorm2d-13         [-1, 128, 32, 256]             256
PointNetSetAbstraction-14  [[-1, 3, 256], [-1, 128, 256]]               0
           Conv2d-15          [-1, 128, 32, 64]          16,896
      BatchNorm2d-16          [-1, 128, 32, 64]             256
           Conv2d-17          [-1, 128, 32, 64]          16,512
      BatchNorm2d-18          [-1, 128, 32, 64]             256
           Conv2d-19          [-1, 256, 32, 64]          33,024
      BatchNorm2d-20          [-1, 256, 32, 64]             512
PointNetSetAbstraction-21  [[-1, 3, 64], [-1, 256, 64]]               0
           Conv2d-22          [-1, 256, 32, 16]          66,560
      BatchNorm2d-23          [-1, 256, 32, 16]             512
           Conv2d-24          [-1, 256, 32, 16]          65,792
      BatchNorm2d-25          [-1, 256, 32, 16]             512
           Conv2d-26          [-1, 512, 32, 16]         131,584
      BatchNorm2d-27          [-1, 512, 32, 16]           1,024
PointNetSetAbstraction-28  [[-1, 3, 16], [-1, 512, 16]]               0
           Conv1d-29              [-1, 256, 64]         196,864
      BatchNorm1d-30              [-1, 256, 64]             512
           Conv1d-31              [-1, 256, 64]          65,792
      BatchNorm1d-32              [-1, 256, 64]             512
PointNetFeaturePropagation-33              [-1, 256, 64]               0
           Conv1d-34             [-1, 256, 256]          98,560
      BatchNorm1d-35             [-1, 256, 256]             512
           Conv1d-36             [-1, 256, 256]          65,792
      BatchNorm1d-37             [-1, 256, 256]             512
PointNetFeaturePropagation-38             [-1, 256, 256]               0
           Conv1d-39            [-1, 256, 1024]          82,176
      BatchNorm1d-40            [-1, 256, 1024]             512
           Conv1d-41            [-1, 128, 1024]          32,896
      BatchNorm1d-42            [-1, 128, 1024]             256
PointNetFeaturePropagation-43            [-1, 128, 1024]               0
           Conv1d-44            [-1, 128, 3000]          16,512
      BatchNorm1d-45            [-1, 128, 3000]             256
           Conv1d-46            [-1, 128, 3000]          16,512
      BatchNorm1d-47            [-1, 128, 3000]             256
           Conv1d-48            [-1, 128, 3000]          16,512
      BatchNorm1d-49            [-1, 128, 3000]             256
PointNetFeaturePropagation-50            [-1, 128, 3000]               0
    Pointnet_plus-51            [-1, 128, 3000]               0
           Conv1d-52            [-1, 256, 3000]          33,024
              ELU-53            [-1, 256, 3000]               0
           Conv1d-54            [-1, 128, 3000]          32,896
              ELU-55            [-1, 128, 3000]               0
           Conv1d-56              [-1, 2, 3000]             258
================================================================
Total params: 1,016,194
Trainable params: 1,016,194
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.17
Forward/backward pass size (MB): 1583.81
Params size (MB): 3.88
Estimated Total Size (MB): 1587.86
----------------------------------------------------------------

